# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [34]:

import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [35]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [36]:

print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [37]:
a[2]

300

What are the values of index for series a?

In [38]:
a.index
print(a)

0    100
1    200
2    300
3    400
dtype: int64

# Change the index to  ['c', 'a', 'b', 'd']

In [39]:
a.index = ['c' , 'a' , 'b' ,'d']
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [40]:
a['d']

400

Sort the values wrt to the index and print it

In [41]:
a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [42]:
b = pd.Series([800,450,100],index = ['e','f','g'])
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [43]:
pd.concat([a, b])

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [44]:
#print a again after appending b into it
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [45]:
# a = pd.Series([200, 300, 100, 400], index=['a', 'b', 'c', 'd'])
sorted_series = a.sort_values(ascending=False)
print(sorted_series.index)

Index(['d', 'b', 'a', 'c'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [46]:
# df 
df = a.to_frame(name='values')
print(df)

   values
c     100
a     200
b     300
d     400

What is the shape of the datafarme <br>
(also, what does it imply?)

In [47]:
df.shape

(4, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [48]:
# yep its same as the series.

df.index

Index(['c', 'a', 'b', 'd'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [49]:

print(df.head)
print(df.tail)

<bound method NDFrame.head of    values
c     100
a     200
b     300
d     400>
<bound method NDFrame.tail of    values
c     100
a     200
b     300
d     400>

Rename the column of the dataframe as 'points'

In [50]:
df.rename(columns = {'values' : 'points'},inplace = True)

print(df)

   points
c     100
a     200
b     300
d     400

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [51]:
#Create fruits array
import numpy as np
import pandas as pdf
fruits_list = ['orange','mango','apple']
fruits = pd.Series(np.random.choice(fruits_list, size=7))
print(fruits)

0     mango
1     apple
2     mango
3     mango
4    orange
5     mango
6    orange
dtype: object

In [32]:
#Create series fruits out of fruits array

fruits_array = np.random.choice(['orange', 'mango', 'apple'], size=7)
pd.Series(fruits_array)

0     mango
1     apple
2     mango
3    orange
4    orange
5     mango
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

In [64]:
fruits = pd.Series([0, 1, 2, 3, 4, 5, 6])
df= pd.DataFrame({'values': [100, 200, 300, 400, 500, 600, 700]}, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
fruits.index = df.index  
print(fruits)

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [66]:
df['fruits'] = ['mango','apple' , 'mango' , 'mango' , 'orange' , 'mango' , 'orange']
df

   values  fruits
a     100   mango
b     200   apple
c     300   mango
d     400   mango
e     500  orange
f     600   mango
g     700  orange

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [73]:
d1 = pd.DataFrame({'city' :['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ] , 'Temperature' : [15, 22, 20, 26,-2]})

Print(d1)

In [74]:

print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [77]:
d1.shape

(5, 2)

Set city = d1['city']

In [80]:
city = d1['city']

print city <br>
What is the type of city.

In [82]:
print(city)
type(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

pandas.core.series.Series

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [93]:
d2 = pd.DataFrame({'city' :['Bengalaru','Coimbatore','Srirangam','Pondicherry'],'Temperature' :[24,35,36,39]})

print the shape of this dataframe

In [86]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [96]:
d3 = pd.concat([d1, d2], ignore_index=True)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengalaru           24
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [101]:
C1 = d3[d3['Temperature'] <= 20]
print(C1)

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [103]:
C2 = d3[d3['Temperature'] >= 35]
print(C2)

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [107]:
# write function here

# def is_ut(x):
    
#     # write code below
ut = ['Chandigarh', 'Pondicherry', 'Delhi']
d3['is_ut'] = d3['city'].isin(ut)

In [108]:
# print d3
print(d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
5    Bengalaru           24  False
6   Coimbatore           35  False
7    Srirangam           36  False
8  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [112]:
# write function here
def c_to_f(celsius):
    return (celsius * 9/5) + 32

In [111]:
# check function c_to_f(10)

result = c_to_f(10)
print(result)

50.0

In [113]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['Temperature_Fahrenheit'] = d3['Temperature'].apply(c_to_f)
print(d3)

          city  Temperature  is_ut  Temperature_Fahrenheit
0   Chandigarh           15   True                    59.0
1        Delhi           22   True                    71.6
2       Kanpur           20  False                    68.0
3      Chennai           26  False                    78.8
4       Manali           -2  False                    28.4
5    Bengalaru           24  False                    75.2
6   Coimbatore           35  False                    95.0
7    Srirangam           36  False                    96.8
8  Pondicherry           39   True                   102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [116]:
ss_d1 = d1[d1['city'].isin(ut)]
print(ss_d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [128]:

ss = d3[d3['Temperature_Fahrenheit'] > 90]
print(ss)

          city  Temperature  is_ut  Temperature_Fahrenheit
6   Coimbatore           35  False                    95.0
7    Srirangam           36  False                    96.8
8  Pondicherry           39   True                   102.2

Select only the first three rows of the dataframe d1.

In [124]:
d1.head(3)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [126]:
c1 = d1.iloc[:, -2:]
print(c1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

## Groupby

In [130]:
# Create a dataframe using dictionary of your choice

data = {
    'Name': ['Ana', 'Bittu', 'Chanti', 'Dattu', 'Elice'],
    'Age': [24, 30, 22, 35, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 50000, 120000, 90000]}

In [133]:
# Use Groupby of single column with aggregate sum()
df = pd.DataFrame(data)
g_df = df.groupby('City')['Salary'].sum().reset_index()
print(g_df)

          City  Salary
0      Chicago   50000
1      Houston  120000
2  Los Angeles   80000
3     New York   70000
4      Phoenix   90000

In [135]:
# Use Groupby of single column with aggregate count()

g_c_df = df.groupby('City').size().reset_index(name='Count')
print(g_c_df)

          City  Count
0      Chicago      1
1      Houston      1
2  Los Angeles      1
3     New York      1
4      Phoenix      1

In [137]:
# Use Groupby of single column with aggregate min() and max()

g_min_max_df = df.groupby('City')['Salary'].agg(['min', 'max']).reset_index()
print(g_min_max_df)

          City     min     max
0      Chicago   50000   50000
1      Houston  120000  120000
2  Los Angeles   80000   80000
3     New York   70000   70000
4      Phoenix   90000   90000

In [139]:
# Use Groupby of any 2 columns with aggregate mean()
g_mean_df = df.groupby(['City', 'Age'])['Salary'].mean().reset_index()
print(g_mean_df)

          City  Age    Salary
0      Chicago   22   50000.0
1      Houston   35  120000.0
2  Los Angeles   30   80000.0
3     New York   24   70000.0
4      Phoenix   29   90000.0

In [140]:
# Use Groupby of any 2 columns with aggregate min() and max()
g_min_max_df = df.groupby(['City', 'Age'])['Salary'].agg(['min', 'max']).reset_index()
print(g_min_max_df)

          City  Age     min     max
0      Chicago   22   50000   50000
1      Houston   35  120000  120000
2  Los Angeles   30   80000   80000
3     New York   24   70000   70000
4      Phoenix   29   90000   90000

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [141]:
a = pd.date_range(start='2020-01-01', end='2021-04-01')

print a

In [142]:

print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [143]:
len(a)

457

What is the type of a?

In [144]:

type(a)

pandas.core.indexes.datetimes.DatetimeIndex